Repository: abumusasakib/VisionXAI-FrontendUI
Catalog: lib/l10n/app_*.arb
Languages: bn

# settingsScreenTitle
source: Settings
bn: সেটিংস

# ip
source: IP Address
bn: IP ঠিকানা

source: Port
bn: পোর্ট

# ipPortUpdated
source: IP and Port updated successfully
bn: IP এবং পোর্ট সফলভাবে আপডেট করা হয়েছে

# enterIpAndPort
source: Please enter IP and Port
bn: অনুগ্রহ করে IP এবং পোর্ট লিখুন

# updateIp
source: Update IP Address
bn: IP ঠিকানা আপডেট করুন

# imageUploadFailedMessage
source: Image upload failed
bn: ছবি আপলোড ব্যর্থ হয়েছে

# chooseImage
source: Choose image to generate caption
bn: ক্যাপশন তৈরি করতে ইমেজ বেছে নিন

source: No image selected
bn: কোনো ছবি নির্বাচন করা হয়নি

source: Generating Caption...
bn: ক্যাপশন তৈরি করা হচ্ছে...

# captionText
source: Caption will appear here
bn: ক্যাপশন এখানে প্রদর্শিত হবে

# stopCaptionGeneration
source: Stop
bn: থামো

source: Upload Image
bn: ছবি আপলোড করুন৷

source: Generate Caption
bn: ক্যাপশন তৈরি করুন

# selectImageFrom
source: Select image from source
bn: উৎস থেকে ছবি নির্বাচন করুন

# camera
source: Capture Image with Camera
bn: ক্যামেরা দিয়ে ছবি ক্যাপচার করুন

source: Select Image from Gallery
bn: গ্যালারি থেকে ছবি নির্বাচন করুন

# errorTitle
source: Error
bn: ত্রুটি

source: OK
bn: ঠিক আছে

source: Language
bn: ভাষা

source: Language Settings
bn: ভাষা সেটিংস

source: Select Language
bn: ভাষা নির্বাচন করুন

source: IP Configuration
bn: আইপি কনফিগারেশন

source: No Language Selected
bn: কোন ভাষা নির্বাচিত নেই

source: About
bn: সম্পর্কিত

source: Current Language
bn: বর্তমান ভাষা

source: Version
bn: সংস্করণ

source: Platform
bn: প্ল্যাটফর্ম

source: Listen
bn: শুনুন

source: Stop
bn: থামুন

# uploadFailed
source: Failed to upload image. Status: {statusCode}
bn: ছবি আপলোড ব্যর্থ হয়েছে। স্ট্যাটাস: {statusCode}

# uploadCancelled
source: Image upload was cancelled.
bn: ছবি আপলোড বাতিল করা হয়েছে।

# uploadError
source: An error occurred during image upload: {error}
bn: ছবি আপলোডের সময় একটি ত্রুটি ঘটেছে: {error}

# captionCancelled
source: Caption generation was cancelled.
bn: ক্যাপশন তৈরি বাতিল করা হয়েছে।

# captionStopped
source: Caption generation stopped by user.
bn: ব্যবহারকারী ক্যাপশন তৈরি বন্ধ করেছেন।

# captionFailed
source: Failed to generate caption. Status: {statusCode}
bn: ক্যাপশন তৈরি ব্যর্থ হয়েছে। স্ট্যাটাস: {statusCode}

# captionInProgress
source: Caption generation already in progress.
bn: ক্যাপশন তৈরি ইতিমধ্যেই চলছে।

# generalError
source: An error occurred: {error}
bn: একটি ত্রুটি ঘটেছে: {error}

# noCaptionInProgress
source: No caption generation in progress.
bn: কোনো ক্যাপশন তৈরি চলছে না।

# captionStoppedShort
source: Stopped caption generation...
bn: ক্যাপশন তৈরি বন্ধ করা হয়েছে...

# imageUploaded
source: Image uploaded successfully.
bn: ছবি সফলভাবে আপলোড করা হয়েছে।

# captionGenerationStopped
source: Caption generation has been stopped.
bn: ক্যাপশন তৈরি বন্ধ করা হয়েছে।

# failedToSpeak
source: Failed to speak the caption
bn: টেক্সট-টু-স্পিচ ব্যর্থ হয়েছে।

# connectionTimeout
source: Connection timed out. Please try again.
bn: সংযোগে সময় শেষ হয়েছে। আবার চেষ্টা করুন।

# badResponse
source: Server error occurred (Status code: {statusCode}).
bn: সার্ভারে সমস্যা হয়েছে (স্ট্যাটাস কোড: {statusCode})।

# requestCancelled
source: Request was cancelled.
bn: অনুরোধ বাতিল করা হয়েছে।

# noInternetOrServerUnreachable
source: Unable to connect. Please check your internet or server address.
bn: সংযোগ ব্যর্থ হয়েছে। অনুগ্রহ করে ইন্টারনেট বা সার্ভার ঠিকানা যাচাই করুন।

# unknownError
source: An unexpected error occurred. Please try again later.
bn: একটি অপ্রত্যাশিত ত্রুটি ঘটেছে। পরে আবার চেষ্টা করুন।

# captionMissing
source: No caption available.
bn: কোনো ক্যাপশন প্রাপ্ত হয়নি।

source: Palette Settings
bn: প্যালেট সেটিংস

source: Color Configuration
bn: রঙ কনফিগারেশন

source: Primary Color
bn: প্রাথমিক রঙ

source: Secondary Color
bn: দ্বিতীয় রঙ

source: Background Color
bn: পটভূমির রঙ

# actionsSection
source: Actions
bn: কার্যক্রম

source: Save
bn: সংরক্ষণ করুন

source: Delete
bn: মুছে ফেলুন

source: Reset
bn: রিসেট করুন

source: Cancel
bn: বাতিল করুন

# presetNameAlertTitle
source: Name Preset
bn: নাম প্রিসেট করুন

# presetNamePlaceholder
source: Provide preset name
bn: প্রিসেট নাম প্রদান করুন

source: Presets List
bn: প্রিসেট তালিকা

source: Save Preset
bn: প্রিসেট সংরক্ষণ করুন

# generate
source: Generate from Background
bn: পটভূমি থেকে তৈরি করুন

source: Generate from Image
bn: ছবি থেকে তৈরি করুন

source: Pick from files
bn: ফাইল থেকে নির্বাচন করুন

source: Pick from gallery
bn: গ্যালারি থেকে নির্বাচন করুন

# localFilesNotSupported
source: Local files not supported on web
bn: ওয়েবে লোকাল ফাইল সমর্থিত নয়

# paletteGenerationFailed
source: Failed to generate palette: {error}
bn: প্যালেট তৈরি ব্যর্থ হয়েছে: {error}

source: Generating Palette...
bn: প্যালেট তৈরি করা হচ্ছে...

# deletePresetTitle
source: Delete Preset?
bn: প্রিসেট মুছে ফেলবেন?

# deletePresetMessage
source: Delete preset {presetName}?
bn: প্রিসেট {presetName} মুছে ফেলবেন?

# resetConfirmation
source: Reset successfully
bn: রিসেট সফল হয়েছে
